# read design  读文件
read_verilog Crc.v
hierarchy -check -top counter

# the high-level stuff 
proc; opt; memory; opt; fsm; opt

# mapping to internal cell library
techmap; opt
yo
# mapping flip-flops to mycells.lib ---mycells.lib和mycells.v是自定义的库文件
dfflibmap -liberty mycells.lib

# mapping logic to mycells.lib
abc -liberty mycells.lib

# cleanup
clean
#生成counter_gate.v文件
write_verilog counter_gate.v 